In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [98]:
train=pd.read_csv('titanic_train.csv')
test=pd.read_csv('titanic_test.csv')

In [3]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [5]:
survived=train['Survived']

In [6]:
train.drop('Survived',axis=1,inplace=True)

In [7]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Pclass       891 non-null    int64
 2   Name         891 non-null    object
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.7+ KB

In [8]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [10]:
train_test=pd.concat([train,test])

In [12]:
train_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Pclass       1309 non-null   int64
 2   Name         1309 non-null   object
 3   Sex          1309 non-null   object
 4   Age          1046 non-null   float64
 5   SibSp        1309 non-null   int64
 6   Parch        1309 non-null   int64
 7   Ticket       1309 non-null   object
 8   Fare         1308 non-null   float64
 9   Cabin        295 non-null    object
 10  Embarked     1307 non-null   object
dtypes: float64(2), int64(4), object(5)
memory usage: 122.7+ KB

In [13]:
train_test.drop(['PassengerId','Ticket','Cabin'],axis=1,inplace=True)

In [15]:
train_test.drop('Name',axis=1,inplace=True)

In [16]:
train_test.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [17]:
train_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    1309 non-null   int64
 1   Sex       1309 non-null   object
 2   Age       1046 non-null   float64
 3   SibSp     1309 non-null   int64
 4   Parch     1309 non-null   int64
 5   Fare      1308 non-null   float64
 6   Embarked  1307 non-null   object
dtypes: float64(2), int64(3), object(2)
memory usage: 81.8+ KB

In [18]:
def impute_age(cols):
    Age = cols[0]
    Pclass = cols[1]
    
    if pd.isnull(Age):

        if Pclass == 1:
            return 37

        elif Pclass == 2:
            return 29

        else:
            return 24

    else:
        return Age

In [19]:
train_test['Age'] = train_test[['Age','Pclass']].apply(impute_age,axis=1)

In [24]:
train_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    1309 non-null   int64
 1   Sex       1309 non-null   object
 2   Age       1309 non-null   float64
 3   SibSp     1309 non-null   int64
 4   Parch     1309 non-null   int64
 5   Fare      1309 non-null   float64
 6   Embarked  1307 non-null   object
dtypes: float64(2), int64(3), object(2)
memory usage: 81.8+ KB

In [26]:
train_test['Embarked'].fillna('S',inplace=True)

In [27]:
train_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    1309 non-null   int64
 1   Sex       1309 non-null   object
 2   Age       1309 non-null   float64
 3   SibSp     1309 non-null   int64
 4   Parch     1309 non-null   int64
 5   Fare      1309 non-null   float64
 6   Embarked  1309 non-null   object
dtypes: float64(2), int64(3), object(2)
memory usage: 81.8+ KB

In [28]:
sex=pd.get_dummies(train_test.Sex)

In [29]:
sex

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
413       0     1
414       1     0
415       0     1
416       0     1
417       0     1

[1309 rows x 2 columns]

In [30]:
embarked=pd.get_dummies(train_test.Embarked)

In [31]:
train_test_cleaned=pd.concat([train_test,sex,embarked],axis=1)

In [32]:
train_test_cleaned

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,female,male,C,Q,S
0,3,male,22.0,1,0,7.2500,S,0,1,0,0,1
1,1,female,38.0,1,0,71.2833,C,1,0,1,0,0
2,3,female,26.0,0,0,7.9250,S,1,0,0,0,1
3,1,female,35.0,1,0,53.1000,S,1,0,0,0,1
4,3,male,35.0,0,0,8.0500,S,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
413,3,male,24.0,0,0,8.0500,S,0,1,0,0,1
414,1,female,39.0,0,0,108.9000,C,1,0,1,0,0
415,3,male,38.5,0,0,7.2500,S,0,1,0,0,1
416,3,male,24.0,0,0,8.0500,S,0,1,0,0,1
417,3,male,24.0,1,1,22.3583,C,0,1,1,0,0

In [34]:
train_test_cleaned.drop(['Embarked','Sex'],axis=1,inplace=True)

In [35]:
train_test_cleaned

     Pclass   Age  SibSp  Parch      Fare  female  male  C  Q  S
0         3  22.0      1      0    7.2500       0     1  0  0  1
1         1  38.0      1      0   71.2833       1     0  1  0  0
2         3  26.0      0      0    7.9250       1     0  0  0  1
3         1  35.0      1      0   53.1000       1     0  0  0  1
4         3  35.0      0      0    8.0500       0     1  0  0  1
..      ...   ...    ...    ...       ...     ...   ... .. .. ..
413       3  24.0      0      0    8.0500       0     1  0  0  1
414       1  39.0      0      0  108.9000       1     0  1  0  0
415       3  38.5      0      0    7.2500       0     1  0  0  1
416       3  24.0      0      0    8.0500       0     1  0  0  1
417       3  24.0      1      1   22.3583       0     1  1  0  0

[1309 rows x 10 columns]

In [40]:
from sklearn.preprocessing import StandardScaler

In [41]:
scalar=StandardScaler()

In [42]:
scalar.fit(train_test_cleaned)

StandardScaler(copy=True, with_mean=True, with_std=True)

In [43]:
scaled_values=scalar.transform(train_test_cleaned)

In [45]:
scaled_values

array([[ 0.84191642, -0.54450783,  0.48128777, ..., -0.50976981,
        -0.32204029,  0.65501092],
       [-1.54609786,  0.67432024,  0.48128777, ...,  1.96166973,
        -0.32204029, -1.52669211],
       [ 0.84191642, -0.23980082, -0.47908676, ..., -0.50976981,
        -0.32204029,  0.65501092],
       ...,
       [ 0.84191642,  0.71240862, -0.47908676, ..., -0.50976981,
        -0.32204029,  0.65501092],
       [ 0.84191642, -0.39215433, -0.47908676, ..., -0.50976981,
        -0.32204029,  0.65501092],
       [ 0.84191642, -0.39215433,  0.48128777, ...,  1.96166973,
        -0.32204029, -1.52669211]])

In [46]:
scaled_df=pd.DataFrame(data=scaled_values,columns=train_test_cleaned.columns)

In [47]:
scaled_df

,Pclass,Age,SibSp,Parch,Fare,female,male,C,Q,S
0,0.841916,-0.544508,0.481288,-0.445000,-0.503590,-0.743497,0.743497,-0.50977,-0.32204,0.655011
1,-1.546098,0.674320,0.481288,-0.445000,0.734507,1.344995,-1.344995,1.96167,-0.32204,-1.526692
2,0.841916,-0.239801,-0.479087,-0.445000,-0.490539,1.344995,-1.344995,-0.50977,-0.32204,0.655011
3,-1.546098,0.445790,0.481288,-0.445000,0.382929,1.344995,-1.344995,-0.50977,-0.32204,0.655011
4,0.841916,0.445790,-0.479087,-0.445000,-0.488122,-0.743497,0.743497,-0.50977,-0.32204,0.655011
...,...,...,...,...,...,...,...,...,...,...
1304,0.841916,-0.392154,-0.479087,-0.445000,-0.488122,-0.743497,0.743497,-0.50977,-0.32204,0.655011
1305,-1.546098,0.750497,-0.479087,-0.445000,1.461834,1.344995,-1.344995,1.96167,-0.32204,-1.526692
1306,0.841916,0.712409,-0.479087,-0.445000,-0.503590,-0.743497,0.743497,-0.50977,-0.32204,0.655011
1307,0.841916,-0.392154,-0.479087,-0.445000,-0.488122,-0.743497,0.743497,-0.50977,-0.32204,0.655011
1308,0.841916,-0.392154,0.481288,0.710763,-0.211468,-0.743497,0.743497,1.96167,-0.32204,-1.526692

In [52]:
train_final=scaled_df[:891]

In [53]:
train_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    float64
 1   Age     891 non-null    float64
 2   SibSp   891 non-null    float64
 3   Parch   891 non-null    float64
 4   Fare    891 non-null    float64
 5   female  891 non-null    float64
 6   male    891 non-null    float64
 7   C       891 non-null    float64
 8   Q       891 non-null    float64
 9   S       891 non-null    float64
dtypes: float64(10)
memory usage: 69.7 KB

In [57]:
test_final=scaled_df[891:]

In [58]:
test_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 891 to 1308
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  418 non-null    float64
 1   Age     418 non-null    float64
 2   SibSp   418 non-null    float64
 3   Parch   418 non-null    float64
 4   Fare    418 non-null    float64
 5   female  418 non-null    float64
 6   male    418 non-null    float64
 7   C       418 non-null    float64
 8   Q       418 non-null    float64
 9   S       418 non-null    float64
dtypes: float64(10)
memory usage: 32.8 KB

In [61]:
from sklearn.decomposition import PCA

In [62]:
pca=PCA(n_components=2)

In [63]:
pca.fit(scaled_df)

PCA(copy=True, iterated_power='auto', n_components=2, random_state=None,
    svd_solver='auto', tol=0.0, whiten=False)

In [64]:
x_pca=pca.transform(scaled_df)

In [66]:
x_pca.shape

(1309, 2)

In [67]:
pca_df=pd.DataFrame(data=x_pca,columns=['pca1','pca2'])

In [68]:
pca_df.head()

       pca1      pca2
0 -1.673896  0.367277
1  3.293113 -1.057901
2  0.219837  1.556495
3  1.571460  0.641677
4 -1.649529 -0.300975

In [72]:
train_final=pca_df[:891]

In [73]:
train_final.shape

(891, 2)

In [74]:
train_final

         pca1      pca2
0   -1.673896  0.367277
1    3.293113 -1.057901
2    0.219837  1.556495
3    1.571460  0.641677
4   -1.649529 -0.300975
..        ...       ...
886 -1.274370 -0.493907
887  1.146774  0.875146
888  0.859179  2.588636
889  0.810540 -2.479790
890 -0.954841 -0.591782

[891 rows x 2 columns]

In [75]:
test_final=pca_df[891:]

In [76]:
test_final.shape

(418, 2)

    train_final
    test_final
    survived

In [77]:
X_train=train_final
y_train=survived
X_test=test_final

In [78]:
from sklearn.linear_model import LogisticRegression

In [79]:
lm=LogisticRegression()

In [82]:
lm.fit(X_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [83]:
lm.score(X_train,y_train)

0.7800224466891134

In [84]:
from sklearn.neighbors import KNeighborsClassifier

In [85]:
from sklearn.ensemble import RandomForestClassifier

In [92]:
rfc=RandomForestClassifier(n_estimators=600)

In [94]:
rfc.fit(X_train,y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=600,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [95]:
rfc.score(X_train,y_train)

0.9820426487093153

In [96]:
predictions=rfc.predict(X_test)

In [97]:
predictions

array([0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0,
       1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1,
       1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0,
       1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1,
       0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0,
       0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0,
       1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1,
       0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1],
      dtype=int64)

In [99]:
Submission = pd.DataFrame({ 'PassengerId': test['PassengerId'],
                            'Survived': predictions })

In [100]:
Submission

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         1
4            896         0
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         1

[418 rows x 2 columns]

In [103]:
Submission.to_csv("prakrit_titanic4.csv", index=False)